// ==========================================
// Default Roles
// ==========================================

const defaultDeck = [

    "마피아",
    "마피아",
    "마피아",
    "보조직업",
    "자경단원",
    "의사",
    "시민"

];

// ==========================================
// Support Roles
// ==========================================

const supportRoles = [

    "짐승인간",
    "스파이",
    "마담",
    "마녀",
    "과학자",
    "도둑",
    "사기꾼",
    "청부업자",
    "대부",
    "악인"

];

// ==========================================
// Special Roles
// ==========================================

const specialRoles = [

    "군인",
    "정치인",
    "영매",
    "기자",
    "건달",
    "사립탐정",
    "테러리스트",
    "성직자",
    "예언자",
    "판사",
    "간호사",
    "마술사",
    "해커",
    "심리학자",
    "용병",
    "공무원",
    "파파라치",
    "최면술사",
    "점쟁이"

];

// ==========================================
// Character Image
// ==========================================

function getCharacterImage(role){

    return `img/${role}.png`;

}

// ==========================================
// Current Deck
// ==========================================

let currentDeck = [];